Revit 2027 API
ExternalResourceTypes.BuiltInExternalResourceTypes.PointCloud Property
 An external resource type representing Point Clouds. This type is reserved for future expansion but not yet implemented.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalResourceType PointCloud { get; }
Public Shared ReadOnly Property PointCloud As ExternalResourceType
	Get
public:
static property ExternalResourceType^ PointCloud {
	ExternalResourceType^ get ();
}
static member PointCloud : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace